Run python backtest_v8.py
در حال دریافت تاریخچه کندل‌ها از CoinEx برای SOLUSDT...
تعداد کل کندل‌های دریافت شده: 1000
📅 بازه زمانی داده‌ها: از 2026-08-19 22:00 تا 2026-08-30 07:45 (حدود 10.4 روز)
--------------------------------------------------
شروع بک‌تست روی 1000 کندلِ SOLUSDT با سرمایه اولیه 1000.0$...
--------------------------------------------------
--------------------------------------------------
📊 نتایج نهایی بک‌تست:
🔹 کل معاملات انجام شده: 77
✅ معاملات موفق (Win): 31
❌ معاملات ناموفق (Loss): 46
🎯 وین‌ریت استراتژی: 40.26%
💰 سرمایه نهایی: 1813.26$
📈 سود/زیان خالص: +813.26$ (+81.33%)
📈 میانگین تعداد معامله در روز: 7.4
